import NavItem from './NavItem';
// import LOGO from './../asset/lOGO.svg'


const Navbar = () => {
  // let scaling:any;
  // function onMenu(){
  //   let a:any
  //   let app:any
  //   let chbox:any;
  //   chbox=document.getElementById('menu-toggle');
  //   a = document.getElementById('menu');


  //   if (chbox.checked) {
  //     // a.style.marginLeft = "0px"
  //     let wm = window.innerWidth
  //     if (wm < 500){
  //       a.style.width = window.innerWidth - 20 + "px"
  //     }
  //      else{
  //       a.style.width = "400px"
  //     }

  //     a.style.visibility = "visible";


  //   }
  //   else {
  //     // a.style.marginLeft = "1000px"


  //     a.style.width = "0px"
  //     a.style.visibility = "hidden";
  //     let uncheck=a.getElementsByTagName('input');
  //     for(var i=0;i<uncheck.length;i++)
  //     {
  //      if(uncheck[i].type=='checkbox')
  //      {
  //       uncheck[i].checked=false;
  //      }
  //     }

  //   }
  // }


  return (
    <div className="Nav nav-font-size color_lv_1-1h ">
      <div className="filling" >
        {/* <img src={LOGO} alt="" /> */}
      </div>

      <div className='nav_wrap'>
        <NavItem url={"/contact"} nitem={"Контактная информация"}
          iitem={<svg xmlns="http://www.w3.org/2000/svg" fill="currentColor" viewBox="0 0 24 24" width="24px" height="24px"><path d="M19,21c0,.553-.447,1-1,1H6c-.552,0-1-.447-1-1s.448-1,1-1h12c.553,0,1,.447,1,1Zm-13-3c.552,0,1-.448,1-1s-.448-1-1-1-1,.448-1,1,.448,1,1,1Zm-4,2c-.552,0-1,.448-1,1s.448,1,1,1,1-.448,1-1-.448-1-1-1Zm0-4c-.552,0-1,.448-1,1s.448,1,1,1,1-.448,1-1-.448-1-1-1Zm9,1c0-.552-.448-1-1-1s-1,.448-1,1,.448,1,1,1,1-.448,1-1Zm13-7.915l-.085,1.264c.002,1.431-1.219,2.651-2.719,2.651-.044,0-2.522-.322-2.522-.322-1.445-.038-2.613-1.208-2.648-2.654l-.155-1.292c-1.309-.494-2.609-.748-3.875-.754-1.311,.008-2.587,.243-3.864,.744l-.157,1.302c-.035,1.446-1.203,2.616-2.648,2.654,0,0-2.479,.322-2.523,.322C1.303,13,.083,11.779,.083,10.279L.002,9.153c-.003-1.451,.549-2.767,1.554-3.772C6.046,.892,17.954,.892,22.443,5.381c1.005,1.006,1.558,2.321,1.557,3.704Zm-1.998-.07c0-.779-.346-1.593-.974-2.22-3.983-3.983-14.625-3.431-18.057,0-.627,.627-.972,1.44-.971,2.288l.08,1.127c.002,.446,.298,.762,.672,.788,0,0,2.458-.319,2.502-.319,.397,0,.721-.324,.721-.722,0-.04,.24-2.051,.24-2.051,.042-.349,.264-.65,.584-.794,1.683-.753,3.476-1.135,5.206-1.135,1.704,.009,3.447,.388,5.179,1.128,.329,.141,.558,.445,.601,.801,0,0,.239,2.011,.239,2.051,0,.397,.324,.722,.722,.722,.044,0,2.502,.319,2.502,.319,.373-.026,.669-.339,.669-.719l.085-1.265Zm-7.002,7.985c0-.552-.448-1-1-1s-1,.448-1,1,.448,1,1,1,1-.448,1-1Zm7-1c-.552,0-1,.448-1,1s.448,1,1,1,1-.448,1-1-.448-1-1-1Zm0,4c-.552,0-1,.448-1,1s.448,1,1,1,1-.448,1-1-.448-1-1-1Zm-4-4c-.552,0-1,.448-1,1s.448,1,1,1,1-.448,1-1-.448-1-1-1Z" /></svg>
          } />
        <NavItem
          url={"/About"}
          nitem={"Сведения о медицинской организации"}
          iitem={<svg xmlns="http://www.w3.org/2000/svg" fill="currentColor" viewBox="0 0 24 24" width="24px" height="24px"><path d="m7.5 13a4.5 4.5 0 1 1 4.5-4.5 4.505 4.505 0 0 1 -4.5 4.5zm0-7a2.5 2.5 0 1 0 2.5 2.5 2.5 2.5 0 0 0 -2.5-2.5zm7.5 17v-.5a7.5 7.5 0 0 0 -15 0v.5a1 1 0 0 0 2 0v-.5a5.5 5.5 0 0 1 11 0v.5a1 1 0 0 0 2 0zm9-5a7 7 0 0 0 -11.667-5.217 1 1 0 1 0 1.334 1.49 5 5 0 0 1 8.333 3.727 1 1 0 0 0 2 0zm-6.5-9a4.5 4.5 0 1 1 4.5-4.5 4.505 4.505 0 0 1 -4.5 4.5zm0-7a2.5 2.5 0 1 0 2.5 2.5 2.5 2.5 0 0 0 -2.5-2.5z" /></svg>
          } />

      </div>
    </div>
  )
}

export default Navbar